app/views/articles/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = ?  [["article_id", 1]]
---
        <div class="col-xs-6 logo"><%= link_to(raw("<i class='fa fa-newspaper-o fa-1x'></i> READABLE"), root_url) %></div>
        <div class="col-xs-3 category"><%= @categories.first.category_name.upcase %></div>