app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = ?  [["article_id", 1]]
SELECT "images".* FROM "images"  WHERE "images"."article_id" = ?  [["article_id", 1]]
---
  def show
    @categories = Article.find_by_id(params[:id]).categories
    @images = Article.find_by_id(params[:id]).images